[
    {
        "sectionTitle": "Projects",
        "title": "3D Printer Hub",
        "subtitle": "Software Engineer | July 2024 - August 2024",
        "bulletPoints": [
            "Project developed during my OpenHub SWE internship. Showcasing the demo.",
            "The purpose of the project was to cut down time spent going to the printers and to give the head engineer a way to verify every print coming in remotely and efficiently."
        ],
        "videoSrc": "projects/printerhub_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "MedGet",
        "subtitle": "Software Engineer | August 2024 - Present",
        "bulletPoints": [
            "Consultancy project given by NeuroX1, a biotech startup in Austin, TX.",
            "Developing a full-stack app, used by medical professional to retrieve data on drugs filtered by a in-house trained LLM.",
            "Meant to reduce research time. Currently around $9000/month are being poured by the company into a VM and tokens for the project to train the LLM.",
            "Leveraging Python, Streamlit, HuggingFace, BioMixtral 8x22B LLM, and OpenAI API. As well as data visualization libraries: Numpy, Pandas, Matplotlib, and Pychart.",
            "The video demo is from the prototype."
        ],
        "videoSrc": "projects/medget_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "Finance.ai",
        "subtitle": "Software Developer | August 2024",
        "bulletPoints": [
            "Full-stack app developed as a customer support tool for financial tips.",
            "Showcases a authentication system with Google and a email and password combo, a feedback mechanism for users, multi-language support, and a fine-tunned model for better and more human responses.",
            "Leveraged Javascript, Node.js, React.js, Next.js, and Firebase. Libraries and APIs: OpenAI API, and OpenAI's Fine-Tunning.",
            "Maintained using a CI/CD Pipeline through Vercel.",
            "Got around 15 registered active users using it for daily financial tips for day-to-day decisions."
        ],
        "videoSrc": "projects/robinhood.ai_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "Flashie",
        "subtitle": "Software Developer | August 2024",
        "bulletPoints": [
            "Full-stack SaaS app that allows users to create flashcards depending on their study or work needs.",
            "Contains an authentication system, flexible payment system, paywall, and a fine-tuned AI model for precise and accurate card generation.",
            "Leveraged Javascript, Node.js, React.js, Next.js, and Firebase. Libraries and APIs: OpenAI API, Stripe API, Clerk API, and OpenAI's Fine-Tunning."
        ],
        "videoSrc": "projects/flashie.ai_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "Inventory Dashboard",
        "subtitle": "Software Developer | August 2024",
        "bulletPoints": [
            "Developed a full-stack app meant to track inventory or to be used as a centralized database.",
            "Incorporates users and roles, an AI assistant for data management, data visualization as well as image recognition for data input.",
            "Leveraged Javascript, Node.js, React.js, Next.js, and Firebase. Libraries and APIs: OpenAI API, Google Cloud Vision API, USDA API, Chart.js, Camera-Pro, and MUI. As well as ML trainers like Vertex AI and AutoML.",
            "Maintained using a CI/CD Pipeline through Vercel.",
            "Got around 20 users registered and using the app for their own purposes."
        ],
        "videoSrc": "projects/inventorytracker_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "Brainstorm",
        "subtitle": "Software Developer | July 2024",
        "bulletPoints": [
            "Project Recommender full-stack app that leverages AI to tailor to your resume and/or skills you know or want to learn.",
            "Leveraged React.js, Javacript, Express.js, Node.js, Firebase, and OpenAI API.",
            "Had around 50 active users before API tokens ran out.",
            "Done in a 24 hour period for a hackathon."
        ],
        "videoSrc": "projects/brainstormai_demo.mp4",
        "src": ""
    },
    {
        "sectionTitle": "Projects",
        "title": "This Portfolio",
        "subtitle": "Software Engineer | July 2024",
        "bulletPoints": [
            "Developed using Javascript, Node.js, React.js, HTML, and CSS. As well as Firebase for any back-end and hosting.",
            "Continously being updated and maintained using a CI/CD pipeline through Firebase."
        ],
        "videoSrc": "projects/portfolio_demo.mp4",
        "src": ""
    }
]
